Repository: Mina-Nashaat10/route_tech_task
Catalog: lib/app/l10n/intl_*.arb
Languages: ar_eg

source: App Name
ar_eg: اسم التطبيق

source: English
ar_eg: الانجليزية

source: Arabic
ar_eg: العربية

# success
source: Request successful.
ar_eg: الطلب تم بنجاح.

# bad_request_error
source: Bad request. Please check your input and try again.
ar_eg: طلب غير صالح. يرجى التحقق من البيانات الخاصة بك والمحاولة مرة أخرى.

# bad_response_error
source: Bad response. The server returned an invalid response.
ar_eg: رد سيء. أعاد الخادم ردًا غير صالح.

# no_content
source: No content found matching your request.
ar_eg: لا يوجد محتوى مطابق لطلبك.

# forbidden_error
source: Access forbidden. You do not have permission to access this resource.
ar_eg: الوصول ممنوع. ليس لديك إذن للوصول إلى هذا المورد.

# unauthorized_error
source: Unauthorized access. Please log in with proper credentials.
ar_eg: وصول غير مصرح به. يرجى تسجيل الدخول ببيانات الاعتماد الصحيحة.

# not_found_error
source: Resource not found. The requested resource could not be found.
ar_eg: المورد غير موجود. المورد المطلوب غير موجود.

# conflict_error
source: Conflict error. There is a conflict with the current state of the resource.
ar_eg: خطأ في التضارب. هناك تضارب في الحالة الحالية للمورد.

# internal_server_error
source: Internal server error. Please try again later.
ar_eg: خطأ في الخادم الداخلي. يرجى المحاولة مرة أخرى لاحقًا.

# unknown_error
source: Unknown error occurred. Please contact support for assistance.
ar_eg: حدث خطأ غير معروف. يرجى الاتصال بالدعم للمساعدة.

# timeout_error
source: Request timeout. The request took too long to process.
ar_eg: نفذ الوقت المحدد للطلب. استغرق المعالجة وقتًا طويلاً.

# default_error
source: An error occurred. Please try again later.
ar_eg: حدث خطأ. يرجى المحاولة مرة أخرى لاحقًا.

# cache_error
source: Cache error. Unable to retrieve data from cache.
ar_eg: خطأ في التخزين المؤقت. غير قادر على استرداد البيانات من التخزين المؤقت.

# no_internet_error
source: No internet connection. Please check your internet connection and try again.
ar_eg: لا يوجد اتصال بالإنترنت. يرجى التحقق من اتصال الإنترنت الخاص بك والمحاولة مرة أخرى.

# data_processing_error
source: Data processing error. Unable to process the data.
ar_eg: خطأ في معالجة البيانات. غير قادر على معالجة البيانات.

source: No items found.
ar_eg: لم يتم العثور على عناصر.

source: Try again
ar_eg: حاول مرة أخرى

# download_button_progress_title
source: Please wait: {percent}%
ar_eg: برجاء الإنتظار: {percent}%

source: EGP
ar_eg: ج.م

source: Review
ar_eg: مراجعة

# search_hint
source: what do you search for?
ar_eg: ماذا تبحث عنه؟
